user_tutorial/thermFluidOptFoam/thermFluid_fixedWallTemp/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
nu                       nu [0 2 -1 0 0 0 0]    60.0e-6;    // Viscosity (when nu_temp_dep=0)

// Temperature dependent viscosity controls
nu_temp_dep                                     0;          // Use temperature dependent viscosity? (yes=1)
nu_k                   nu_k [0 2 -1  0 0 0 0]   7.0e-05;    // Viscosity at nu_T_base
nu_n                   nu_n [0 0  0  0 0 0 0]   1;          // Fluid behavior index (1 for Newtonian)
nu_slope           nu_slope [0 2 -1 -1 0 0 0]   1.02e-06;   // Slope of viscosity vs. temperature
nu_T_ref           nu_T_ref [0 0  0  1 0 0 0]   313.15;     // Reference temperature
nu_min               nu_min [0 2 -1  0 0 0 0]   1.0e-09;    // Viscosity minimum
nu_max               nu_max [0 2 -1  0 0 0 0]   1.0e-03;    // Viscosity maximum

// Porosity controls
alpha_U_max     alpha_U_max [0 0 -1 0 0 0 0]    2.5e3;      // Flow resistance max reference
q_factor                                        0.005;      // Shape factor used to scale ramp function
